<?php

return [
    'csrf_token_mismatch' => 'Невідповідність токенів CSRF. Будь ласка, оновіть сторінку та спробуйте ще раз.',
    'too_many_attempts' => 'Забагато спроб. Зачекайте дві хвилини та спробуйте ще раз.',

    'email_already_registered' => 'Користувач з такою поштою вже зареєстрований.',
    'error_sending_email' => 'Помилка відправки e-mail. Спробуйте ще раз.',
    'phone_already_registered' => 'Користувач з таким номером телефону вже зареєстрований.',
    'get_new_code' => 'Отримайте новий код підтвердження.',
    'invalid_verification_code' => 'Невірний код підтвердження. Отримайте новий код.',
    'success_registration' => 'Успішна реєстрація!',
    'error_registration' => 'Помилка реєстрації. Спробуйте ще раз.',
    'phone_not_registered' => 'Користувач з таким номером телефону не зареєстрований.',
    'email_not_registered' => 'Користувач з таким e-mail не зареєстрований.',

    'you_refused_authorization_site' => 'Ви відхилили вхід до сайту.',

    'services_not_db' => 'Сервіси ще не додані до бази даних.',


    'auth_error' => 'Технічні роботи. Авторизація тимчасово недоступна.',
];