<?php

return [
    'home' => [
        'title' => 'Главная | Flexy',
        'desc' => 'Делаем кредиты дешевыми и доступными.',
    ],
    'services' => [
        'title' => 'Кредитные сервисы | Flexy',
        'desc' => 'Выбери лучшие сервисы, получай скидки, используй возможности.',
    ],
    'blog' => [
        'title' => 'Блог | Flexy',
        'desc' => 'Актуальные статьи о кредитных сервисах. Свежие новости о кредитных сервисах.',
    ],
    'about' => [
        'title' => 'О нас | Flexy',
        'desc' => 'Команда энтузиастов, которая на собственном опыте знает, как трудно бывает получить кредит именно тогда, когда это наиболее нужно.',
    ],
    'contacts' => [
        'title' => 'Контакты | Trixy',
        'desc' => 'Контакты Trixy',
    ],
    'forgot-pass' => [
        'title' => 'Відновлення пароля | Trixy',
        'desc' => 'Форма відновлення пароля',
    ],
    'reset-pass' => [
        'title' => 'Зміна пароля | Trixy',
        'desc' => 'Форма зміни пароля',
    ],

];