<?php

return [
    'home' => [
        'title' => 'Головна | Trixy',
        'desc' => 'Робимо кредити дешевими та доступними.',
    ],
    'services' => [
        'title' => 'Кредитні сервіси | Trixy',
        'desc' => 'Оберай найкращі сервіси, отримуй знижки, використовуй можливості.',
    ],
    'blog' => [
        'title' => 'Блог | Trixy',
        'desc' => 'Актуалні статті про кредитні сервіси. Свіжі новини о кредитних сервісах.',
    ],
    'about' => [
        'title' => 'Про нас | Trixy',
        'desc' => 'Команда ентузіастів, яка на власному досвіді знає як важко буває отримати кредит саме тоді, коли це найбільш потрібно.',
    ],
    'contacts' => [
        'title' => 'Контакти | Trixy',
        'desc' => 'Контакти Trixy',
    ],
    'forgot-pass' => [
        'title' => 'Відновлення пароля | Trixy',
        'desc' => 'Форма відновлення пароля',
    ],
    'reset-pass' => [
        'title' => 'Зміна пароля | Trixy',
        'desc' => 'Форма зміни пароля',
    ],

];